sterentev/atdf-device-asm-include/inc/AT90PWM316.inc
; ====	PSC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PICR0 bits		------------------------
.equ	PCST0		= 15		; 0x8000 - PSC 0 Input Capture Software Trig
.equ	PICR0_MASK	= 0x0FFF	;      - PSC 0 Input Capture Bytes (12 bits)
.equ	PICR00		= 0		;          PICR0 BIT0 position

; ----------	Register PFRC0B bits		------------------------
.equ	PCAE0B		= 7		; 0x80 - PSC 0 Capture Enable Input Part B
.equ	PISEL0B		= 6		; 0x40 - PSC 0 Input Select for Part B
.equ	PELEV0B		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part B
.equ	PFLTE0B		= 4		; 0x10 - PSC 0 Filter Enable on Input Part B
.equ	PRFM0B_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM0B0		= 0		;          PRFM0B BIT0 position

; ----------	Register PFRC0A bits		------------------------
.equ	PCAE0A		= 7		; 0x80 - PSC 0 Capture Enable Input Part A
.equ	PISEL0A		= 6		; 0x40 - PSC 0 Input Select for Part A
.equ	PELEV0A		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part A
.equ	PFLTE0A		= 4		; 0x10 - PSC 0 Filter Enable on Input Part A
.equ	PRFM0A_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM0A0		= 0		;          PRFM0A BIT0 position

; ----------	Register PCTL0 bits		------------------------
.equ	PPRE0_MASK	= 0xC0		;      - PSC 0 Prescaler Selects (2 bits)
.equ	PPRE00		= 6		;          PPRE0 BIT0 position
.equ	PBFM0		= 5		; 0x20 - PSC 0 Balance Flank Width Modulation
.equ	PAOC0B		= 4		; 0x10 - PSC 0 Asynchronous Output Control B
.equ	PAOC0A		= 3		; 0x08 - PSC 0 Asynchronous Output Control A
.equ	PARUN0		= 2		; 0x04 - PSC0 Auto Run
.equ	PCCYC0		= 1		; 0x02 - PSC0 Complete Cycle
.equ	PRUN0		= 0		; 0x01 - PSC 0 Run

; ----------	Register PCNF0 bits		------------------------
.equ	PFIFTY0		= 7		; 0x80 - PSC 0 Fifty
.equ	PALOCK0		= 6		; 0x40 - PSC 0 Autolock
.equ	PLOCK0		= 5		; 0x20 - PSC 0 Lock
.equ	PMODE0_MASK	= 0x18		;      - PSC 0 Mode (2 bits)
.equ	PMODE00		= 3		;          PMODE0 BIT0 position
.equ	POP0		= 2		; 0x04 - PSC 0 Output Polarity
.equ	PCLKSEL0	= 1		; 0x02 - PSC 0 Input Clock Select

; ----------	Register PSOC0 bits		------------------------
.equ	PSYNC0_MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC00		= 4		;          PSYNC0 BIT0 position
.equ	POEN0B		= 2		; 0x04 - PSCOUT01 Output Enable
.equ	POEN0A		= 0		; 0x01 - PSCOUT00 Output Enable

; ----------	Register PIM0 bits		------------------------
.equ	PSEIE0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt Enable
.equ	PEVE0B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE0A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE0		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR0 bits		------------------------
.equ	POAC0B		= 7		; 0x80 - PSC 0 Output A Activity
.equ	POAC0A		= 6		; 0x40 - PSC 0 Output A Activity
.equ	PSEI0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt
.equ	PEV0B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV0A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN0_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN00		= 1		;          PRN0 BIT0 position
.equ	PEOP0		= 0		; 0x01 - End of PSC0 Interrupt

; ----------	Register PICR1 bits		------------------------
.equ	PCST1		= 15		; 0x8000 - PSC 1 Input Capture Software Trig
.equ	PICR1_MASK	= 0x0FFF	;      - PSC 1 Input Capture Bytes (12 bits)
.equ	PICR10		= 0		;          PICR1 BIT0 position

; ----------	Register PFRC1B bits		------------------------
.equ	PCAE1B		= 7		; 0x80 - PSC 1 Capture Enable Input Part B
.equ	PISEL1B		= 6		; 0x40 - PSC 1 Input Select for Part B
.equ	PELEV1B		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part B
.equ	PFLTE1B		= 4		; 0x10 - PSC 1 Filter Enable on Input Part B
.equ	PRFM1B_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM1B0		= 0		;          PRFM1B BIT0 position

; ----------	Register PFRC1A bits		------------------------
.equ	PCAE1A		= 7		; 0x80 - PSC 1 Capture Enable Input Part A
.equ	PISEL1A		= 6		; 0x40 - PSC 1 Input Select for Part A
.equ	PELEV1A		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part A
.equ	PFLTE1A		= 4		; 0x10 - PSC 1 Filter Enable on Input Part A
.equ	PRFM1A_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM1A0		= 0		;          PRFM1A BIT0 position

; ----------	Register PCTL1 bits		------------------------
.equ	PPRE1_MASK	= 0xC0		;      - PSC 1 Prescaler Selects (2 bits)
.equ	PPRE10		= 6		;          PPRE1 BIT0 position
.equ	PBFM1		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC1B		= 4		; 0x10 - PSC 1 Asynchronous Output Control B
.equ	PAOC1A		= 3		; 0x08 - PSC 1 Asynchronous Output Control A
.equ	PARUN1		= 2		; 0x04 - PSC1 Auto Run
.equ	PCCYC1		= 1		; 0x02 - PSC1 Complete Cycle
.equ	PRUN1		= 0		; 0x01 - PSC 1 Run

; ----------	Register PCNF1 bits		------------------------
.equ	PFIFTY1		= 7		; 0x80 - PSC 1 Fifty
.equ	PALOCK1		= 6		; 0x40 - PSC 1 Autolock
.equ	PLOCK1		= 5		; 0x20 - PSC 1 Lock
.equ	PMODE1_MASK	= 0x18		;      - PSC 1 Mode (2 bits)
.equ	PMODE10		= 3		;          PMODE1 BIT0 position
.equ	POP1		= 2		; 0x04 - PSC 1 Output Polarity
.equ	PCLKSEL1	= 1		; 0x02 - PSC 1 Input Clock Select

; ----------	Register PSOC1 bits		------------------------
.equ	PSYNC1__MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC1_0	= 4		;          PSYNC1_ BIT0 position
.equ	POEN1B		= 2		; 0x04 - PSCOUT11 Output Enable
.equ	POEN1A		= 0		; 0x01 - PSCOUT10 Output Enable

; ----------	Register PIM1 bits		------------------------
.equ	PSEIE1		= 5		; 0x20 - PSC 1 Synchro Error Interrupt Enable
.equ	PEVE1B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE1A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE1		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR1 bits		------------------------
.equ	POAC1B		= 7		; 0x80 - PSC 1 Output B Activity
.equ	POAC1A		= 6		; 0x40 - PSC 1 Output A Activity
.equ	PSEI1		= 5		; 0x20 - PSC 1 Synchro Error Interrupt
.equ	PEV1B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV1A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN1_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN10		= 1		;          PRN1 BIT0 position
.equ	PEOP1		= 0		; 0x01 - End of PSC1 Interrupt

; ----------	Register PICR2 bits		------------------------
.equ	PCST2		= 15		; 0x8000 - PSC 2 Input Capture Software Trig
.equ	PICR2_MASK	= 0x0FFF	;      - PSC 2 Input Capture Bytes (12 bits)
.equ	PICR20		= 0		;          PICR2 BIT0 position

